
/**
 * 该文件由 .my/core/build/svg.js 生成
 */
 
import Vue from 'vue'
import globalConfig from '$ui/config'

const Icon = ({props}) => {
  const attrs = {...globalConfig.svg, ...props}
  return (
    <svg {...{attrs: attrs}}>
       <path d="M1024 680v88c0 35.3-28.7 64-64 64H64c-35.3 0-64-28.7-64-64v-88c0-4.4 3.6-8 8-8h1008c4.4 0 8 3.6 8 8zM960 192H64c-35.3 0-64 28.7-64 64v344c0 4.4 3.6 8 8 8h1008c4.4 0 8-3.6 8-8V256c0-35.3-28.7-64-64-64zM416 540c0 2.2-1.8 4-4 4h-56c-2.2 0-4-1.8-4-4v-56c0-2.2 1.8-4 4-4h56c2.2 0 4 1.8 4 4v56z m96 0c0 2.2-1.8 4-4 4h-56c-2.2 0-4-1.8-4-4v-56c0-2.2 1.8-4 4-4h56c2.2 0 4 1.8 4 4v56z m96 0c0 2.2-1.8 4-4 4h-56c-2.2 0-4-1.8-4-4v-56c0-2.2 1.8-4 4-4h56c2.2 0 4 1.8 4 4v56z m96 0c0 2.2-1.8 4-4 4h-56c-2.2 0-4-1.8-4-4v-56c0-2.2 1.8-4 4-4h56c2.2 0 4 1.8 4 4v56z m96 0c0 2.2-1.8 4-4 4h-56c-2.2 0-4-1.8-4-4v-56c0-2.2 1.8-4 4-4h56c2.2 0 4 1.8 4 4v56z m96 0c0 2.2-1.8 4-4 4h-56c-2.2 0-4-1.8-4-4v-56c0-2.2 1.8-4 4-4h56c2.2 0 4 1.8 4 4v56z"/>
    </svg>
  )
}

Vue.component('icon-card-fill', Icon)
export default Icon

