
/**
 * 该文件由 .my/core/build/svg.js 生成
 */
 
import Vue from 'vue'
import globalConfig from '$ui/config'

const Icon = ({props}) => {
  const attrs = {...globalConfig.svg, ...props}
  return (
    <svg {...{attrs: attrs}}>
       <path d="M-0.5,95.5v832c0,53,43,96,96,96h832c53,0,96-43,96-96v-832c0-53-43-96-96-96h-832C42.5-0.5-0.5,42.5-0.5,95.5z  M895.5,959.5h-768c-35.3,0-64-28.7-64-64v-768c0-35.3,28.7-64,64-64h768c35.3,0,64,28.7,64,64v768  C959.5,930.8,930.8,959.5,895.5,959.5z"/> <path d="M825.8,351.8L486.4,691.2c-25,25-65.5,25-90.5,0l0,0h0L260.2,555.4c-12.5-12.5-12.5-32.8,0-45.2l0,0  c12.5-12.5,32.8-12.5,45.3,0l124.5,124.5c6.2,6.2,16.4,6.2,22.6,0l328.1-328.1c12.5-12.5,32.8-12.5,45.3,0l0,0  C838.3,319.1,838.3,339.3,825.8,351.8z"/>
    </svg>
  )
}

Vue.component('icon-go-select', Icon)
export default Icon

