
/**
 * 该文件由 .my/core/build/svg.js 生成
 */
 
import Vue from 'vue'
import globalConfig from '$ui/config'

const Icon = ({props}) => {
  const attrs = {...globalConfig.svg, ...props}
  return (
    <svg {...{attrs: attrs}}>
       <path d="M1023.6 239v68.3h-20.1c-22 0-43 8.7-59 23.9l-0.2 0.2c-7.3 6.8-15.9 10.1-25.9 10.1H105c-10.1 0-18.6-3.3-25.8-10.1-0.1-0.1-0.2-0.1-0.3-0.2-16-15.1-37-23.8-59-23.8H0V239L511.8 34.3 1023.6 239zM986.7 887.2H36.8c-10 0-18.6 3.3-25.8 10.1-7.4 6.8-11 14.8-11 24.1v68.3h1023.6v-68.3c0-9.3-3.7-17.3-11-24.1-7.3-6.8-15.8-10.1-25.9-10.1zM955.5 819v34H68.3v-34c0-9.2 3.6-17.3 11-24.1 7.3-6.8 15.9-10.1 25.8-10.1h31.5l-0.1-409.4H273v409.4h68.3V375.4h136.4v409.4h68.6V375.4h136.4v409.4h68.1V375.4h136.4v409.4h31.5c10.1 0 18.5 3.3 25.8 10.1 7.3 6.8 11 14.9 11 24.1z"/>
    </svg>
  )
}

Vue.component('icon-university-fill', Icon)
export default Icon

